import sympy as sp
import numpy as np

# Definindo a variável simbólica
n = sp.symbols('n')

[750, 850, 935, 1100, 1260, 1530, 1760, 1980, 2020, 2500, 2710, 3050, 3580, 4800]
[ -98.56321839  -91.18421053 -100.35897436  -96.37209302  -89.
  -88.95454545  -86.45        -92.76315789  -79.5         -94.
 -108.52380952  -99.31578947 -113.81818182 -115.        ]


d0 = 750
p0 = -98.56321839

#p1 = -82.85 - 10*n*np.log10(40/40)
p2 = p0 - 10*n*np.log10(850/d0)
p3 = p0 - 10*n*np.log10(935/d0)
p4 = p0 - 10*n*np.log10(1100/d0)
p5 = p0 - 10*n*np.log10(1260/d0)
p6 = p0 - 10*n*np.log10(1530/d0)
p7 = p0 - 10*n*np.log10(1760/d0)
p8 = p0 - 10*n*np.log10(1980/d0)
p9 = p0 - 10*n*np.log10(2020/d0)
p10 = p0 - 10*n*np.log10(2500/d0)
p11 = p0 - 10*n*np.log10(2710/d0)
p12 = p0 - 10*n*np.log10(3050/d0)
p13 = p0 - 10*n*np.log10(3580/d0)
p14 = p0 - 10*n*np.log10(4800/d0)
#p1 = -82.85
#p1_0 = -82.85
p2_0 = -91.18421053
p3_0 = -100.35897436
p4_0 = -96.37209302
p5_0 = -89
p6_0 = -88.95454545
p7_0 = -86.45 
p8_0 = -92.76315789
p9_0 = -79.5
p10_0 = -94
p11_0 = -108.52380952
p12_0 = -99.31578947
p13_0 = -113.81818182
p14_0 = -115
# Definindo a função
funcao = (p2_0 - p2)**2  + (p3_0 - p3)**2 + (p4_0 - p4)**2 + (p5_0 - p5)**2 + (p6_0 - p6)**2 + (p7_0 - p7)**2 + (p8_0 - p8)**2 + (p9_0 - p9)**2 + (p10_0 - p10)**2 + (p11_0 - p11)**2 + (p11_0 - p11)**2 + (p12_0 - p12)**2 + (p13_0 - p13)**2 + (p14_0 - p14)**2
#pt2 = (p2_0 - p2)**2
#funcao = (p2_0 - p2)**2 
#print(pt2)
# Calculando a derivada em relação a n
derivada = sp.diff(funcao, n)
valor_n = sp.solve(derivada, n)
# Imprimindo a derivada
print(derivada)
print(valor_n)